levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/inc/hc32m423_efm.h
/**
 * @defgroup EFM_Wait_Cycle EFM Wait Cycle 
 * @{
 */
#define EFM_WAIT_CYCLE_0            (0x00000000UL)   /*!< Don't insert read wait cycle */
#define EFM_WAIT_CYCLE_1            (0x00000001UL)   /*!< Insert 1 read wait cycles */
#define EFM_WAIT_CYCLE_2            (0x00000002UL)   /*!< Insert 2 read wait cycles */
#define EFM_WAIT_CYCLE_3            (0x00000003UL)   /*!< Insert 3 read wait cycles */
#define EFM_WAIT_CYCLE_4            (0x00000004UL)   /*!< Insert 4 read wait cycles */
#define EFM_WAIT_CYCLE_5            (0x00000005UL)   /*!< Insert 5 read wait cycles */
#define EFM_WAIT_CYCLE_6            (0x00000006UL)   /*!< Insert 6 read wait cycles */
#define EFM_WAIT_CYCLE_7            (0x00000007UL)   /*!< Insert 7 read wait cycles */
/**
 * @}
 */

/**
 * @defgroup EFM_CacheRst_Func EFM data cache reset function
 * @{
 */
#define EFM_CACHERST_ON             (EFM_FRMC_CRST)  /*!< Enable data cache reset function */
#define EFM_CACHERST_OFF            (0x00000000UL)   /*!< Disable data cache reset function */
/**
 * @}
 */

/**
 * @defgroup EFM_InsCache_Func EFM instruction cache function
 * @{
 */
#define EFM_INSCACHE_ON             (EFM_FRMC_ICHE)  /*!< Enable instruction cache function */
#define EFM_INSCACHE_OFF            (0x00000000UL)   /*!< Disable instruction cache function */
/**
 * @}
 */

/**
 * @defgroup EFM_DataCache_Func EFM data cache function
 * @{
 */
#define EFM_DATACACHE_ON            (EFM_FRMC_DCHE)  /*!< Enable data cache function */
#define EFM_DATACACHE_OFF           (0x00000000UL)   /*!< Disable data cache function */
/**
 * @}
 */

/**
 * @defgroup EFM_Bus_Status EFM Bus status while flash program or erase
 * @{
 */
#define EFM_BUS_BUSY                (0x00000000UL)      /*!< Bus busy while flash program or erase */
#define EFM_BUS_RELEASE             (EFM_FWMC_BUSHLDCTL)/*!< Bus release while flash program or erase */
/**
 * @}
 */

/**
 * @defgroup EFM_Mode_definition EFM program or erase mode definition
 * @{
 */
#define EFM_MODE_PROGRAMSINGLE      (0x00000010UL)         /*!< Program single mode */
#define EFM_MODE_PROGRAMREADBACK    (0x00000020UL)         /*!< Program and read back mode */
#define EFM_MODE_PROGRAMSEQUENCE    (0x00000030UL)         /*!< Program sequence mode */
#define EFM_MODE_ERASESECTOR        (0x00000040UL)         /*!< Sector erase */
#define EFM_MODE_ERASECHIP          (0x00000050UL)         /*!< Chip erase */
#define EFM_MODE_READONLY           (0x00000000UL)         /*!< Read only */
#define EFM_MODE_READONLY1          (0x00000060UL)         /*!< Read only */
#define EFM_MODE_READONLY2          (0x00000070UL)         /*!< Read only */
/**
 * @}
 */

/**
 * @defgroup EFM_Flag_definition EFM Flag definition
 * @{
 */
#define EFM_FLAG_PEWERR             (EFM_FSR_PEWERR)          /*!< EFM Programming/erase error flag.              */
#define EFM_FLAG_PEPRTERR           (EFM_FSR_PEPRTERR)        /*!< EFM Programming/erase protect area error flag. */
#define EFM_FLAG_PGMISMTCHERR       (EFM_FSR_PGMISMTCH)       /*!< EFM Programming  miss match error flag         */
#define EFM_FLAG_OPTEND             (EFM_FSR_OPTEND)          /*!< EFM End of Operation flag.                     */
#define EFM_FLAG_COLERR             (EFM_FSR_RDCOLERR)        /*!< EFM Read collide error flag.                   */
#define EFM_FLAG_RDY                (EFM_FSR_RDY)             /*!< EFM ready flag.                                */

#define EFM_CLR_FLAG_PEWERRCLR      (EFM_FSCLR_PEWERRCLR)     /*!< EFM Clear Programming/erase error flag.              */
#define EFM_CLR_FLAG_PEPRTERRCLR    (EFM_FSCLR_PEPRTERRCLR)   /*!< EFM Clear Programming/erase protect area error flag. */
#define EFM_CLR_FLAG_PGMISMTCHCLR   (EFM_FSCLR_PGMISMTCHCLR)  /*!< EFM Clear Programming  miss match error flag         */
#define EFM_CLR_FLAG_OPTENDCLR      (EFM_FSCLR_OPTENDCLR)     /*!< EFM Clear End of Operation flag.                     */
#define EFM_CLR_FLAG_COLERRCLR      (EFM_FSCLR_RDCOLERRCLR)   /*!< EFM Clear Read collide error flag.                   */

/**
 * @}
 */

/**
 * @defgroup EFM_Interrupt_definition EFM Interrupt definition
 * @{
 */
#define EFM_INT_EOP                 (EFM_FITE_OPTENDITE)      /*!< End of EFM Operation Interrupt source      */
#define EFM_INT_PEERR               (EFM_FITE_PEERRITE)       /*!< Program/erase error Interrupt source       */
#define EFM_INT_RDCOLERR            (EFM_FITE_RDCOLERRITE)    /*!< Read collide error Interrupt source        */
#define EFM_INT_PEERR_OPTEND        (EFM_FITE_PEERRITE  |  \
                                    EFM_FITE_OPTENDITE)       /*!< Program/erase error and End of EFM operation */
#define EFM_INT_PEERR_RDCOLERR      (EFM_FITE_PEERRITE  |  \
                                    EFM_FITE_RDCOLERRITE)     /*!< Program/erase error and Read collide error*/
#define EFM_INT_OPTEND_RDCOLERR     (EFM_FITE_OPTENDITE |  \
                                    EFM_FITE_RDCOLERRITE)     /*!< End of EFM operation and Read collide error*/
#define EFM_INT_ALL                 (EFM_FITE_PEERRITE  |  \
                                    EFM_FITE_OPTENDITE  |  \
                                    EFM_FITE_RDCOLERRITE)     /*!< Program/erase error and End of EFM operation \
                                                                   and Read collide error Interrupt source */
/**
 * @}
 */

/**
 * @defgroup EFM_Keys EFM Keys
 * @{
 */
#define EFM_KEY1                    (0x0123U)
#define EFM_KEY2                    (0x3210U)
/**
 * @}
 */


/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup EFM_Global_Functions
 * @{
 */

void EFM_Unlock(void);
void EFM_Lock(void);

void EFM_Cmd(uint32_t u32efmstatus);
void EFM_SetWaitCycle(uint32_t u32WaitCycle);
void EFM_SetBusStatus(uint32_t u32Status);
void EFM_DataCacheCmd(en_functional_state_t enNewState);
void EFM_DataCacheRstCmd(en_functional_state_t enNewState);
void EFM_InsCacheCmd(en_functional_state_t enNewState);
void EFM_SetWinProtectAddr(uint32_t u32StartAddr, uint32_t u32EndAddr);
void EFM_InterruptCmd(uint32_t u32EfmInt, en_functional_state_t enNewState);
void EFM_SetOperateMode(uint32_t u32PeMode);
void EFM_ClearFlag(uint32_t u32Flag);

en_result_t EFM_StrucInit(stc_efm_cfg_t *pstcEfmCfg);
en_result_t EFM_Init(const stc_efm_cfg_t *pstcEfmCfg);
en_result_t EFM_ProgramWord(uint32_t u32Addr, uint32_t u32Data);
en_result_t EFM_ProgramHalfWord(uint32_t u32Addr, uint16_t u16Data);
en_result_t EFM_ProgramWordRB(uint32_t u32Addr, uint32_t u32Data);
en_result_t EFM_ProgramHalfWordRB(uint32_t u32Addr, uint16_t u16Data);
en_result_t EFM_SequenceProgram(uint32_t u32Addr, uint32_t u32Len, uint8_t *u8pBuf);
en_result_t EFM_SectorErase(uint32_t u32Addr);
en_result_t EFM_ChipErase(void);

en_flag_status_t EFM_GetFlagStatus(uint32_t u32Flag);
stc_efm_unique_id_t EFM_ReadUID(void);
/**
 * @}
 */

#endif /* DDL_EFM_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32M423_EFM_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
